# استخدم import من هذا الملف في main.py

# جميع الرسائل النصية المستخدمة في البوت

WELCOME_MESSAGE = (
    "🌿 أهلاً بك في بوت صدقه | Sadqa الإسلامي.\n"
    " البوت صدقه جارية على روح صديقنا (يوسف أحمد إبراهيم) ادعو له بالرحمه والمغفره 🤍 \n"
    
    "\nاختر ما يناسبك 👇"
)

CHANGE_CITY_PROMPT = "✏️ من فضلك أرسل اسم مدينتك الآن:"
UNSUBSCRIBE_CONFIRM = "🛑 تم إلغاء اشتراكك. نراك لاحقًا بإذن الله."
PRAYER_ERROR = "⚠️ لم نتمكن من جلب المواقيت حاليًا."
CITY_UPDATED = "✅ تم تحديث مدينتك إلى: {city}"
PRAYER_HEADER = ("🕌 مواعيد الصلاة في {city}:\n\n")

UNKNOWN_ERROR = "⚠️ حدث خطأ غير متوقع."
